000_РОЗНИЦА_ЦЕНТР/src/ExchangePlans/ОбменССайтом/ОбменССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="a0c98c5f-7f26-432f-9b21-acd3d6ef0e3d">
  <name>ОбменССайтом</name>
  <attributes>
    <name>АдресСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКаталога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗаказами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменТоварами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПрикладногоРешения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяТаблицаКаталогов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьСоответствиеСтатусовЗаказов</name>
    <attributes>
      <name>СтатусЗаказаНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказаВБазе</name>
      <type>
        <types>EnumRef.СтатусыЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

000_РОЗНИЦА_ЦЕНТР/src/ExchangePlans/ОбменССайтом/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		ВыбраннаяФорма = "ФормаУзла";
		ОбменССайтомВызовСервера.ПереопределитьФормуУзла(ВыбраннаяФорма);
		Если Не ВыбраннаяФорма = "ФормаУзла" Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//	LNK 08.06.2022 08:40:22
Функция ПрименитьОбъектПриКоллизииИзменений(УзелИнформационнойБазы, Объект)	Экспорт

	Возврат Истина;

КонецФункции

#Область ОбработчикиОбновлений

// Устанавливает значение реквизитов формы узла обмена
//
Процедура УстановитьЗначениеРеквизитовВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменССайтом.Ссылка КАК УзелОбмена,
	|	ОбменССайтом.РежимВыгрузки КАК РежимВыгрузки
	|ИЗ
	|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
	|ГДЕ
	|	НЕ ОбменССайтом.Ссылка = &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтом.ЭтотУзел());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПрикладныеПараметрыУзла(Выборка.УзелОбмена, Выборка.РежимВыгрузки);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизит формы узла плана обмена СоответствиеСтатусовЗаказов
// данными табличной части "УдалитьСоответствиеСтатусовЗаказов"
//
Процедура ЗаполнитьРеквизитФормыСоответствиеСтатусовЗаказов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбменССайтом.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменССайтом.УдалитьСоответствиеСтатусовЗаказов КАК ОбменССайтом
	|ГДЕ
	|	НЕ ОбменССайтом.Ссылка = &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтом.ЭтотУзел());

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УзелОбъект = Выборка.Узел.ПолучитьОбъект();
		ПрикладныеПараметры = УзелОбъект.ПараметрыПрикладногоРешения.Получить();
		
		ПараметрыПрикладногоРешения = Неопределено;
		Если Не ПрикладныеПараметры.Свойство("ПараметрыПрикладногоРешения", ПараметрыПрикладногоРешения)
			Или ПараметрыПрикладногоРешения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтатусыЗаказов = Неопределено;
		Если Не ПараметрыПрикладногоРешения.Свойство("СоответствиеСтатусовЗаказов", СтатусыЗаказов)
			Или СтатусыЗаказов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтатусыЗаказов.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтатусыЗаказов = Новый ТаблицаЗначений;
		СтатусыЗаказов.Колонки.Добавить("СтатусЗаказаВБазе");
		СтатусыЗаказов.Колонки.Добавить("СтатусЗаказаНаСайте");
		
		Для Каждого ТекСтрока Из Выборка.Узел.УдалитьСоответствиеСтатусовЗаказов Цикл
			
			НоваяСтрока = СтатусыЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			
		КонецЦикла;
		
		ПараметрыПрикладногоРешения.Вставить("СоответствиеСтатусовЗаказов", СтатусыЗаказов);
		
		ПрикладныеПараметры.Вставить("ПараметрыПрикладногоРешения", ПараметрыПрикладногоРешения);
		
		УзелОбъект.ПараметрыПрикладногоРешения = Новый ХранилищеЗначения(ПрикладныеПараметры);
		
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизит формы узла плана обмена ЕдиницаИзмеренияНовойНоменклатуры
//
Процедура ЗаполнитьРеквизитФормыЕдиницаИзмеренияНовойНоменклатуры() Экспорт
	
	ОбменССайтомВызовСервера.ПереопределитьОбработчикОбновления("ЗаполнитьРеквизитФормыЕдиницаИзмеренияНовойНоменклатуры");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПрикладныеПараметрыУзла(УзелОбмена, РежимВыгрузки)
	
	ВыгружатьТовары = Ложь;
	ВыгружатьЦеныОстатки = Ложь;
	
	Если РежимВыгрузки = 0 Тогда
		ВыгружатьТовары = Истина;
		ВыгружатьЦеныОстатки = Истина;
		
	ИначеЕсли РежимВыгрузки = 1 Тогда
		ВыгружатьТовары = Истина;
		ВыгружатьЦеныОстатки = Ложь;
		
	ИначеЕсли РежимВыгрузки = 2 Тогда
		ВыгружатьТовары = Ложь;
		ВыгружатьЦеныОстатки = Истина;
		
	ИначеЕсли РежимВыгрузки = 3 Тогда
		// Устанавливает флаг в значение Истина,
		// т.к. один из двух флагов должен быть на форме заполнен.
		ВыгружатьТовары = Истина;
		
	КонецЕсли;
	
	ОбновитьПараметры = Ложь;
	
	УзелОбъект = УзелОбмена.ПолучитьОбъект();
	СохраненныеНастройки = УзелОбъект.ПараметрыПрикладногоРешения.Получить();
	
	Если Не ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		СохраненныеНастройки = Новый Структура;
		
		ОбновитьПараметры = Истина;
		
	КонецЕсли;
	
	ПараметрыПрикладногоРешения = Неопределено;
	Если Не СохраненныеНастройки.Свойство("ПараметрыПрикладногоРешения", ПараметрыПрикладногоРешения) Тогда
		ПараметрыПрикладногоРешения = Новый Структура;
		
		ОбновитьПараметры = Истина;
		
	КонецЕсли;
	
	Если Не ПараметрыПрикладногоРешения.Свойство("ВыгружатьТовары") Тогда
		ПараметрыПрикладногоРешения.Вставить("ВыгружатьТовары", ВыгружатьТовары);
		
		ОбновитьПараметры = Истина;
		
	КонецЕсли;
	
	Если Не ПараметрыПрикладногоРешения.Свойство("ВыгружатьЦеныОстатки") Тогда
		ПараметрыПрикладногоРешения.Вставить("ВыгружатьЦеныОстатки", ВыгружатьЦеныОстатки);
		
		ОбновитьПараметры = Истина;
		
	КонецЕсли;
	
	Если ОбновитьПараметры Тогда
		
		СохраненныеНастройки.Вставить("ПараметрыПрикладногоРешения", ПараметрыПрикладногоРешения);
		УзелОбъект.ПараметрыПрикладногоРешения = Новый ХранилищеЗначения(СохраненныеНастройки);
		
		УзелОбъект.Записать();
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
